[Killed] Block removal mutation
Raft.Node/Communication/Client/ClientPool.cs:12:5
     private readonly ConcurrentDictionary<NodeAddress, Channel> _channels = new();
 
     private Channel GetChannel(NodeAddress nodeAddress)
-    {
-        return _channels.GetOrAdd(nodeAddress, (key) => new Channel(key.Host, key.Port, ChannelCredentials.Insecure));
-    }
+    {}
 
     public CommandSvc.CommandSvcClient GetCommandServiceClient(NodeAddress targetAddress)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[NoCoverage] Block removal mutation
Raft.Node/Communication/Client/ClientPool.cs:17:5
     }
 
     public CommandSvc.CommandSvcClient GetCommandServiceClient(NodeAddress targetAddress)
-    {
-        return new CommandSvc.CommandSvcClient(GetChannel(targetAddress));
-    }
+    {}
 
     public LeaderDiscoverySvc.LeaderDiscoverySvcClient GetLeaderDiscoveryClient(NodeAddress targetAddress)

[Killed] Block removal mutation
Raft.Node/Communication/Client/ClientPool.cs:22:5
     }
 
     public LeaderDiscoverySvc.LeaderDiscoverySvcClient GetLeaderDiscoveryClient(NodeAddress targetAddress)
-    {
-        return new LeaderDiscoverySvc.LeaderDiscoverySvcClient(GetChannel(targetAddress));
-    }
+    {}
 
     public RegisterNodeSvc.RegisterNodeSvcClient GetRegisterNodeClient(NodeAddress targetAddress)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Block removal mutation
Raft.Node/Communication/Client/ClientPool.cs:27:5
     }
 
     public RegisterNodeSvc.RegisterNodeSvcClient GetRegisterNodeClient(NodeAddress targetAddress)
-    {
-        return new RegisterNodeSvc.RegisterNodeSvcClient(GetChannel(targetAddress));
-    }
+    {}
 
     public AppendEntriesSvc.AppendEntriesSvcClient GetAppendEntriesClient(NodeAddress targetAddress)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Block removal mutation
Raft.Node/Communication/Client/ClientPool.cs:32:5
     }
 
     public AppendEntriesSvc.AppendEntriesSvcClient GetAppendEntriesClient(NodeAddress targetAddress)
-    {
-        return new AppendEntriesSvc.AppendEntriesSvcClient(GetChannel(targetAddress));
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader
