[Killed] Statement mutation
Communication/Services/Admin/ControlService.cs:14:9
 {
     public override Task<DisconnectReply> DisconnectNode(DisconnectMessage request, ServerCallContext context)
     {
-        heartBeatRunner?.StopBeating();
+        ;
         Log.Information("Stopping heartbeat");
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Communication/Services/Admin/ControlService.cs:15:9
     public override Task<DisconnectReply> DisconnectNode(DisconnectMessage request, ServerCallContext context)
     {
         heartBeatRunner?.StopBeating();
-        Log.Information("Stopping heartbeat");
+        ;
 
         raftServer.DisconnectFromCluster();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Communication/Services/Admin/ControlService.cs:17:9
         heartBeatRunner?.StopBeating();
         Log.Information("Stopping heartbeat");
 
-        raftServer.DisconnectFromCluster();
+        ;
         Log.Information("Disconnecting");
         
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Communication/Services/Admin/ControlService.cs:18:9
         Log.Information("Stopping heartbeat");
 
         raftServer.DisconnectFromCluster();
-        Log.Information("Disconnecting");
+        ;
         
         return Task.FromResult(new DisconnectReply {Reply = "Node disconnected."});
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Object initializer mutation
Communication/Services/Admin/ControlService.cs:20:32
         raftServer.DisconnectFromCluster();
         Log.Information("Disconnecting");
         
-        return Task.FromResult(new DisconnectReply {Reply = "Node disconnected."});
+        return Task.FromResult(new DisconnectReply {});
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Communication/Services/Admin/ControlService.cs:25:9
 
     public override Task<ReconnectReply> ReconnectNode(ReconnectMessage request, ServerCallContext context)
     {
-        Log.Information("Reconnecting");
+        ;
         raftServer.ReconnectToCluster();
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Communication/Services/Admin/ControlService.cs:26:9
     public override Task<ReconnectReply> ReconnectNode(ReconnectMessage request, ServerCallContext context)
     {
         Log.Information("Reconnecting");
-        raftServer.ReconnectToCluster();
+        ;
 
         if (stateStore.Role == NodeType.Leader)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Equality mutation
Communication/Services/Admin/ControlService.cs:28:13
         Log.Information("Reconnecting");
         raftServer.ReconnectToCluster();
 
-        if (stateStore.Role == NodeType.Leader)
+        if (stateStore.Role != NodeType.Leader)
         {
             Log.Information("Starting heartbeat");
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[NoCoverage] Statement mutation
Communication/Services/Admin/ControlService.cs:30:13
 
         if (stateStore.Role == NodeType.Leader)
         {
-            Log.Information("Starting heartbeat");
+            ;
             heartBeatRunner?.StartBeating();
         }

[NoCoverage] Statement mutation
Communication/Services/Admin/ControlService.cs:31:13
         if (stateStore.Role == NodeType.Leader)
         {
             Log.Information("Starting heartbeat");
-            heartBeatRunner?.StartBeating();
+            ;
         }
 

[Killed] Object initializer mutation
Communication/Services/Admin/ControlService.cs:34:32
             heartBeatRunner?.StartBeating();
         }
 
-        return Task.FromResult(new ReconnectReply {Reply = "Node reconnected."});
+        return Task.FromResult(new ReconnectReply {});
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
Communication/Services/Admin/ControlService.cs:38:5
     }
 
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return ControlSvc.BindService(this);
-    }
+    {}
 
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
