[Killed] Block removal mutation
Communication/Services/Admin/GetStateService.cs:10:5
 public class GetStateService(INodeStateStore stateStore) : GetStateSvc.GetStateSvcBase, INodeService
 {
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return GetStateSvc.BindService(this);
-    }
+    {}
 
     public override Task<GetStateReply> GetState(GetStateMassage request, ServerCallContext context)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
