[Killed] Arithmetic mutation
Communication/Services/Cluster/AppendEntriesRequestFactory.cs:11:28
 {
     public AppendEntriesRequest CreateRequest(string nodeName, IList<LogEntryMessage> entries)
     {
-        var lastLogIndex = nodeStore.GetNextIndex(nodeName) - 1;
+        var lastLogIndex = nodeStore.GetNextIndex(nodeName) + 1;
         return new AppendEntriesRequest()
         {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader
