[Killed] Statement mutation
Communication/Services/Cluster/AppendEntriesService.cs:13:9
 {
     public override Task<AppendEntriesReply> AppendEntries(AppendEntriesRequest request, ServerCallContext context)
     {
-        Log.Debug($"Appending {request.Entries.Count} entries {request}");
+        ;
         // 1. reply false if term < currentTerm
         // 2. reply false if log doesn't contain an entry at prevLogIndex whose term matches prevLogTerm
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Equality mutation
Communication/Services/Cluster/AppendEntriesService.cs:16:13
         Log.Debug($"Appending {request.Entries.Count} entries {request}");
         // 1. reply false if term < currentTerm
         // 2. reply false if log doesn't contain an entry at prevLogIndex whose term matches prevLogTerm
-        if (stateStore.CurrentTerm > request.Term || stateStore.GetTermAtIndex(request.PrevLogIndex) != request.PrevLogTerm)
+        if (stateStore.CurrentTerm < request.Term || stateStore.GetTermAtIndex(request.PrevLogIndex) != request.PrevLogTerm)
         {
             return Fail();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Equality mutation
Communication/Services/Cluster/AppendEntriesService.cs:16:54
         Log.Debug($"Appending {request.Entries.Count} entries {request}");
         // 1. reply false if term < currentTerm
         // 2. reply false if log doesn't contain an entry at prevLogIndex whose term matches prevLogTerm
-        if (stateStore.CurrentTerm > request.Term || stateStore.GetTermAtIndex(request.PrevLogIndex) != request.PrevLogTerm)
+        if (stateStore.CurrentTerm > request.Term || stateStore.GetTermAtIndex(request.PrevLogIndex) == request.PrevLogTerm)
         {
             return Fail();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Block removal mutation
Communication/Services/Cluster/AppendEntriesService.cs:17:9
         // 1. reply false if term < currentTerm
         // 2. reply false if log doesn't contain an entry at prevLogIndex whose term matches prevLogTerm
         if (stateStore.CurrentTerm > request.Term || stateStore.GetTermAtIndex(request.PrevLogIndex) != request.PrevLogTerm)
-        {
-            return Fail();
-        }
+        {}
         // 3. if there are entries already on the places where the new ones should be appended - remove them
         RemoveConflictingEntries(request);
killedBy: Raft.Node.Tests.AppendEntriesServiceTests.FollowerShouldReplyFailIfCurrentTermHigherThanRequestTerm; Raft.Node.Tests.AppendEntriesServiceTests.FollowerShouldReplySuccessOrFailBasedOnWhetherLastIndexMatchesLastTerm(2,1,False)

[Killed] Statement mutation
Communication/Services/Cluster/AppendEntriesService.cs:21:9
             return Fail();
         }
         // 3. if there are entries already on the places where the new ones should be appended - remove them
-        RemoveConflictingEntries(request);
+        ;
         // 4. append all new entries
         foreach (var entryMessage in request.Entries)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/AppendEntriesService.cs:25:13
         // 4. append all new entries
         foreach (var entryMessage in request.Entries)
         {
-            stateStore.AppendLogEntry(entryMessage.FromMessage());
+            ;
         }
         // 5. update commitIndex
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Negate expression
Communication/Services/Cluster/AppendEntriesService.cs:28:13
             stateStore.AppendLogEntry(entryMessage.FromMessage());
         }
         // 5. update commitIndex
-        if (request.LeaderCommit > stateStore.CommitIndex)
+        if (!(request.LeaderCommit > stateStore.CommitIndex))
         {
             stateStore.CommitIndex = Math.Min(request.LeaderCommit, stateStore.LogLength - 1);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Equality mutation
Communication/Services/Cluster/AppendEntriesService.cs:28:13
             stateStore.AppendLogEntry(entryMessage.FromMessage());
         }
         // 5. update commitIndex
-        if (request.LeaderCommit > stateStore.CommitIndex)
+        if (request.LeaderCommit >= stateStore.CommitIndex)
         {
             stateStore.CommitIndex = Math.Min(request.LeaderCommit, stateStore.LogLength - 1);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
Communication/Services/Cluster/AppendEntriesService.cs:30:69
         // 5. update commitIndex
         if (request.LeaderCommit > stateStore.CommitIndex)
         {
-            stateStore.CommitIndex = Math.Min(request.LeaderCommit, stateStore.LogLength - 1);
+            stateStore.CommitIndex = Math.Min(request.LeaderCommit, stateStore.LogLength + 1);
         }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Linq method mutation (Min() to Max())
Communication/Services/Cluster/AppendEntriesService.cs:30:38
         // 5. update commitIndex
         if (request.LeaderCommit > stateStore.CommitIndex)
         {
-            stateStore.CommitIndex = Math.Min(request.LeaderCommit, stateStore.LogLength - 1);
+            stateStore.CommitIndex = Math.Max(request.LeaderCommit, stateStore.LogLength - 1);
         }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/AppendEntriesService.cs:33:9
             stateStore.CommitIndex = Math.Min(request.LeaderCommit, stateStore.LogLength - 1);
         }
 
-        stateStore.ApplyCommitted();
+        ;
         return Success();
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
Communication/Services/Cluster/AppendEntriesService.cs:48:41
     /// </summary>
     private void RemoveConflictingEntries(AppendEntriesRequest request)
     {
-        stateStore.RemoveLogEntriesFrom(request.PrevLogIndex + 1);
+        stateStore.RemoveLogEntriesFrom(request.PrevLogIndex - 1);
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/AppendEntriesService.cs:48:9
     /// </summary>
     private void RemoveConflictingEntries(AppendEntriesRequest request)
     {
-        stateStore.RemoveLogEntriesFrom(request.PrevLogIndex + 1);
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Object initializer mutation
Communication/Services/Cluster/AppendEntriesService.cs:53:32
 
     private Task<AppendEntriesReply> Success()
     {
-        return Task.FromResult(new AppendEntriesReply
-        {
-            Term = stateStore.CurrentTerm,
-            Success = true
-        });
+        return Task.FromResult(new AppendEntriesReply
+{});
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Boolean mutation
Communication/Services/Cluster/AppendEntriesService.cs:56:23
         return Task.FromResult(new AppendEntriesReply
         {
             Term = stateStore.CurrentTerm,
-            Success = true
+            Success = false
         });
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Boolean mutation
Communication/Services/Cluster/AppendEntriesService.cs:65:23
         return Task.FromResult(new AppendEntriesReply
         {
             Term = stateStore.CurrentTerm,
-            Success = false
+            Success = true
         });
     }
killedBy: Raft.Node.Tests.AppendEntriesServiceTests.FollowerShouldReplyFailIfCurrentTermHigherThanRequestTerm; Raft.Node.Tests.AppendEntriesServiceTests.FollowerShouldReplySuccessOrFailBasedOnWhetherLastIndexMatchesLastTerm(2,1,False)

[Killed] Block removal mutation
Communication/Services/Cluster/AppendEntriesService.cs:70:5
     }
 
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return AppendEntriesSvc.BindService(this);
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
