[Killed] Block removal mutation
Communication/Services/Admin/LogInfoService.cs:18:5
     }
 
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return LogInfoSvc.BindService(this);
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
