[Killed] Equality mutation
Communication/Services/Cluster/LeaderDiscoveryService.cs:12:13
     public override Task<LeaderQueryReply> GetLeader(LeaderQueryRequest request, ServerCallContext context)
     {
         var leaderAddress = stateStore.LeaderAddress;
-        if (leaderAddress == null)
+        if (leaderAddress != null)
         {
             throw new RpcException(new Status(StatusCode.InvalidArgument, "Leader address not initialized"));
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[NoCoverage] Statement mutation
Communication/Services/Cluster/LeaderDiscoveryService.cs:14:13
         var leaderAddress = stateStore.LeaderAddress;
         if (leaderAddress == null)
         {
-            throw new RpcException(new Status(StatusCode.InvalidArgument, "Leader address not initialized"));
+            ;
         }
         return Task.FromResult(new LeaderQueryReply

[Killed] Block removal mutation
Communication/Services/Cluster/LeaderDiscoveryService.cs:24:5
     }
 
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return LeaderDiscoverySvc.BindService(this);
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
