[Killed] Object initializer mutation
Communication/Services/Admin/NodeInfoService.cs:12:32
 {
     public override Task<NodeInfoReply> GetInfo(NodeInfoRequest request, ServerCallContext context)
     {
-        return Task.FromResult(new NodeInfoReply
-        {
-            Address = nodeAddress.ToString(),
-            Name = name,
-            Role = stateStore.Role.ToString(), 
-            LeaderAddress = stateStore.LeaderAddress?.ToString(),
-            KnownNodes = nodeStore.ToString()
-        });
+        return Task.FromResult(new NodeInfoReply
+{});
     }
     
killedBy: Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Block removal mutation
Communication/Services/Admin/NodeInfoService.cs:23:5
     }
     
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return NodeInfoSvc.BindService(this);
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
