[Killed] String mutation
Communication/Services/Admin/PingReplyService.cs:12:21
     {
         return Task.FromResult(new PingReply
         {
-            Reply = $"Pong from {nodeName} at {context.Host}"
+            Reply = $""
         });
     }
killedBy: Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Block removal mutation
Communication/Services/Admin/PingReplyService.cs:17:5
     }
 
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return PingSvc.BindService(this);
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
