[Killed] Equality mutation
Communication/Services/Cluster/LogReplicationService.cs:21:13
 {
     public override Task<CommandReply> ApplyCommand(CommandRequest request, ServerCallContext context)
     {
-        if (stateStore.Role == NodeType.Follower)
+        if (stateStore.Role != NodeType.Follower)
         {
             return ForwardCommand(request);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
Communication/Services/Cluster/LogReplicationService.cs:22:9
     public override Task<CommandReply> ApplyCommand(CommandRequest request, ServerCallContext context)
     {
         if (stateStore.Role == NodeType.Follower)
-        {
-            return ForwardCommand(request);
-        }
+        {}
 
         var command = request.FromMessage();
killedBy: Raft.Node.Tests.LogReplicationServiceTests.FollowerShouldForwardToLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicationService.cs:27:9
         }
 
         var command = request.FromMessage();
-        stateStore.AppendLogEntry(new LogEntry(command, stateStore.CurrentTerm));
+        ;
         Log.Information($"{command} appended in term={stateStore.CurrentTerm}. log is {stateStore.PrintLog()}");
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Survived] Statement mutation
Communication/Services/Cluster/LogReplicationService.cs:28:9
 
         var command = request.FromMessage();
         stateStore.AppendLogEntry(new LogEntry(command, stateStore.CurrentTerm));
-        Log.Information($"{command} appended in term={stateStore.CurrentTerm}. log is {stateStore.PrintLog()}");
+        ;
 
         heartBeatRunner.StopBeating();

[Survived] Statement mutation
Communication/Services/Cluster/LogReplicationService.cs:30:9
         stateStore.AppendLogEntry(new LogEntry(command, stateStore.CurrentTerm));
         Log.Information($"{command} appended in term={stateStore.CurrentTerm}. log is {stateStore.PrintLog()}");
 
-        heartBeatRunner.StopBeating();
+        ;
         logReplicator.ReplicateToFollowers();
         var newState = stateStore.ApplyCommitted();

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicationService.cs:31:9
         Log.Information($"{command} appended in term={stateStore.CurrentTerm}. log is {stateStore.PrintLog()}");
 
         heartBeatRunner.StopBeating();
-        logReplicator.ReplicateToFollowers();
+        ;
         var newState = stateStore.ApplyCommitted();
         heartBeatRunner.StartBeating();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicationService.cs:33:9
         heartBeatRunner.StopBeating();
         logReplicator.ReplicateToFollowers();
         var newState = stateStore.ApplyCommitted();
-        heartBeatRunner.StartBeating();
+        ;
 
         return Task.FromResult(new CommandReply()
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Equality mutation
Communication/Services/Cluster/LogReplicationService.cs:43:13
 
     private Task<CommandReply> ForwardCommand(CommandRequest request)
     {
-        if (stateStore.LeaderAddress == null)
+        if (stateStore.LeaderAddress != null)
         {
             return Task.FromResult(new CommandReply()
killedBy: Raft.Node.Tests.LogReplicationServiceTests.FollowerShouldForwardToLeader

[Survived] Statement mutation
Communication/Services/Cluster/LogReplicationService.cs:52:9
         }
 
         var commandClient = clientPool.GetCommandServiceClient(stateStore.LeaderAddress);
-        Log.Information($"Forwarding command {request}");
+        ;
         return commandClient.ApplyCommandAsync(request).ResponseAsync;
     }

[Killed] Block removal mutation
Communication/Services/Cluster/LogReplicationService.cs:57:5
     }
 
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return CommandSvc.BindService(this);
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
