[Killed] Negate expression
Communication/Services/Cluster/LogReplicator.cs:23:13
 
     public void ReplicateToFollowers()
     {
-        if (clusterStore.GetNodes().Any())
+        if (!(clusterStore.GetNodes().Any()))
         {
             var replies = SendAppendEntriesRequestsAndWaitForResults().Result;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:26:13
         if (clusterStore.GetNodes().Any())
         {
             var replies = SendAppendEntriesRequestsAndWaitForResults().Result;
-            UpdateClusterState(replies);
+            ;
             Log.Information($"Replicated to followers - nextIndex: {clusterStore.GetNextIndexesPrintable()}");
         }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:27:13
         {
             var replies = SendAppendEntriesRequestsAndWaitForResults().Result;
             UpdateClusterState(replies);
-            Log.Information($"Replicated to followers - nextIndex: {clusterStore.GetNextIndexesPrintable()}");
+            ;
         }
         UpdateCommitIndex();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] String mutation
Communication/Services/Cluster/LogReplicator.cs:27:29
         {
             var replies = SendAppendEntriesRequestsAndWaitForResults().Result;
             UpdateClusterState(replies);
-            Log.Information($"Replicated to followers - nextIndex: {clusterStore.GetNextIndexesPrintable()}");
+            Log.Information($"");
         }
         UpdateCommitIndex();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:29:9
             UpdateClusterState(replies);
             Log.Information($"Replicated to followers - nextIndex: {clusterStore.GetNextIndexesPrintable()}");
         }
-        UpdateCommitIndex();
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:40:9
                 node => TrySendAppendEntriesRequest(node, GetEntriesToSendToNode(node.NodeName))
             );
 
-        await Task.WhenAll(tasks.Values.ToArray<Task>());
+        ;
 
         return tasks.ToDictionary(
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Conditional (true) mutation
Communication/Services/Cluster/LogReplicator.cs:44:20
 
         return tasks.ToDictionary(
             kvp => kvp.Key,
-            kvp => kvp.Value.IsCompletedSuccessfully ? kvp.Value.Result : null
+            kvp => (true?kvp.Value.Result :null
+)
         );
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Conditional (false) mutation
Communication/Services/Cluster/LogReplicator.cs:44:20
 
         return tasks.ToDictionary(
             kvp => kvp.Key,
-            kvp => kvp.Value.IsCompletedSuccessfully ? kvp.Value.Result : null
+            kvp => (false?kvp.Value.Result :null
+)
         );
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Equality mutation
Communication/Services/Cluster/LogReplicator.cs:51:16
     public bool IsReplicationComplete(string nodeName)
     {
         var nextIndex = clusterStore.GetNextIndex(nodeName);
-        return nextIndex == stateStore.LogLength;
+        return nextIndex != stateStore.LogLength;
     }
 
killedBy: Raft.Node.Tests.LogReplicatorTests.ShouldReplyIfReplicationToNodeIsComplete(0,0,True); Raft.Node.Tests.LogReplicatorTests.ShouldReplyIfReplicationToNodeIsComplete(1,0,False); Raft.Node.Tests.LogReplicatorTests.ShouldReplyIfReplicationToNodeIsComplete(1,1,True)

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:58:13
     {
         foreach (var (nodeName, reply) in replies)
         {
-            Log.Information($"{nodeName}: {reply}");
+            ;
             if (reply == null)
             {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] String mutation
Communication/Services/Cluster/LogReplicator.cs:58:29
     {
         foreach (var (nodeName, reply) in replies)
         {
-            Log.Information($"{nodeName}: {reply}");
+            Log.Information($"");
             if (reply == null)
             {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Equality mutation
Communication/Services/Cluster/LogReplicator.cs:59:17
         foreach (var (nodeName, reply) in replies)
         {
             Log.Information($"{nodeName}: {reply}");
-            if (reply == null)
+            if (reply != null)
             {
                 continue;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Negate expression
Communication/Services/Cluster/LogReplicator.cs:65:17
             }
 
             var entriesCount = GetNumberOfEntriesToReplicate(nodeName);
-            if (reply.Success)
+            if (!(reply.Success))
             {
                 clusterStore.IncreaseNextLogIndex(nodeName, entriesCount);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:67:17
             var entriesCount = GetNumberOfEntriesToReplicate(nodeName);
             if (reply.Success)
             {
-                clusterStore.IncreaseNextLogIndex(nodeName, entriesCount);
+                ;
                 clusterStore.IncreaseMatchingIndex(nodeName, entriesCount);
             }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:68:17
             if (reply.Success)
             {
                 clusterStore.IncreaseNextLogIndex(nodeName, entriesCount);
-                clusterStore.IncreaseMatchingIndex(nodeName, entriesCount);
+                ;
             }
             else
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:72:17
             }
             else
             {
-                clusterStore.DecreaseNextLogIndex(nodeName);
+                ;
             }
         }
killedBy: Raft.Node.Tests.LogReplicatorTests.LeaderShouldDecreaseNextLogIndexWhenAppendEntryReturnsFailure

[Killed] Equality mutation
Communication/Services/Cluster/LogReplicator.cs:81:13
     {
         var nodes = clusterStore.GetNodes().ToArray();
         var nodesCount = nodes.Count();
-        if (nodesCount == 0)
+        if (nodesCount != 0)
         {
             stateStore.CommitIndex = stateStore.LogLength - 1;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Arithmetic mutation
Communication/Services/Cluster/LogReplicator.cs:83:38
         var nodesCount = nodes.Count();
         if (nodesCount == 0)
         {
-            stateStore.CommitIndex = stateStore.LogLength - 1;
+            stateStore.CommitIndex = stateStore.LogLength + 1;
             return;
         }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:84:13
         if (nodesCount == 0)
         {
             stateStore.CommitIndex = stateStore.LogLength - 1;
-            return;
+            ;
         }
         var matchingIndexes = nodes.Select(x => clusterStore.GetMatchingIndex((x.NodeName))).ToArray();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] Equality mutation
Communication/Services/Cluster/LogReplicator.cs:88:16
         }
         var matchingIndexes = nodes.Select(x => clusterStore.GetMatchingIndex((x.NodeName))).ToArray();
         var current = stateStore.LogLength;
-        while (current > stateStore.CommitIndex)
+        while (current < stateStore.CommitIndex)
         {
             var next = current - 1;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Negate expression
Communication/Services/Cluster/LogReplicator.cs:88:16
         }
         var matchingIndexes = nodes.Select(x => clusterStore.GetMatchingIndex((x.NodeName))).ToArray();
         var current = stateStore.LogLength;
-        while (current > stateStore.CommitIndex)
+        while (!(current > stateStore.CommitIndex))
         {
             var next = current - 1;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Timeout] Arithmetic mutation
Communication/Services/Cluster/LogReplicator.cs:90:24
         var current = stateStore.LogLength;
         while (current > stateStore.CommitIndex)
         {
-            var next = current - 1;
+            var next = current + 1;
             if (MatchingCountAtIndex(matchingIndexes, next) > nodesCount / 2)
             {

[Killed] Negate expression
Communication/Services/Cluster/LogReplicator.cs:91:17
         while (current > stateStore.CommitIndex)
         {
             var next = current - 1;
-            if (MatchingCountAtIndex(matchingIndexes, next) > nodesCount / 2)
+            if (!(MatchingCountAtIndex(matchingIndexes, next) > nodesCount / 2))
             {
                 stateStore.CommitIndex = next;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
Communication/Services/Cluster/LogReplicator.cs:91:63
         while (current > stateStore.CommitIndex)
         {
             var next = current - 1;
-            if (MatchingCountAtIndex(matchingIndexes, next) > nodesCount / 2)
+            if (MatchingCountAtIndex(matchingIndexes, next) > nodesCount * 2)
             {
                 stateStore.CommitIndex = next;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:94:17
             if (MatchingCountAtIndex(matchingIndexes, next) > nodesCount / 2)
             {
                 stateStore.CommitIndex = next;
-                return;
+                ;
             }
             current = next;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Logical mutation
Communication/Services/Cluster/LogReplicator.cs:103:13
     private int MatchingCountAtIndex(int[] matchingIndexes, int current)
     {
         return matchingIndexes.Count(x =>
-            x >= current && stateStore.GetTermAtIndex(current) == stateStore.CurrentTerm);
+            x >= current || stateStore.GetTermAtIndex(current) == stateStore.CurrentTerm);
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Equality mutation
Communication/Services/Cluster/LogReplicator.cs:103:29
     private int MatchingCountAtIndex(int[] matchingIndexes, int current)
     {
         return matchingIndexes.Count(x =>
-            x >= current && stateStore.GetTermAtIndex(current) == stateStore.CurrentTerm);
+            x >= current && stateStore.GetTermAtIndex(current) != stateStore.CurrentTerm);
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:108:9
 
     private async Task<AppendEntriesReply?> TrySendAppendEntriesRequest(NodeInfo node, IList<LogEntry> entries)
     {
-        Log.Information($"Sending append entries to node {node.NodeName} - {entries.Count} entries");
+        ;
         try
         {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Block removal mutation
Communication/Services/Cluster/LogReplicator.cs:110:9
     {
         Log.Information($"Sending append entries to node {node.NodeName} - {entries.Count} entries");
         try
-        {
-            return await SendAppendEntriesRequestAsync(node, entries.Select(e => e.ToMessage())
-                .ToArray(), TimeSpan.FromSeconds(timeoutSeconds));
-        }
+        {}
         catch (RpcException ex) when (ex.StatusCode == StatusCode.DeadlineExceeded)
         {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Survived] Equality mutation
Communication/Services/Cluster/LogReplicator.cs:114:39
             return await SendAppendEntriesRequestAsync(node, entries.Select(e => e.ToMessage())
                 .ToArray(), TimeSpan.FromSeconds(timeoutSeconds));
         }
-        catch (RpcException ex) when (ex.StatusCode == StatusCode.DeadlineExceeded)
+        catch (RpcException ex) when (ex.StatusCode != StatusCode.DeadlineExceeded)
         {
             Log.Information($"Timeout occurred for node {node.NodeName}: {ex.GetType()} {ex.Message}");

[Killed] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:116:13
         }
         catch (RpcException ex) when (ex.StatusCode == StatusCode.DeadlineExceeded)
         {
-            Log.Information($"Timeout occurred for node {node.NodeName}: {ex.GetType()} {ex.Message}");
+            ;
             return null;
         }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] String mutation
Communication/Services/Cluster/LogReplicator.cs:116:29
         }
         catch (RpcException ex) when (ex.StatusCode == StatusCode.DeadlineExceeded)
         {
-            Log.Information($"Timeout occurred for node {node.NodeName}: {ex.GetType()} {ex.Message}");
+            Log.Information($"");
             return null;
         }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Survived] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:121:13
         }
         catch (RpcException ex)
         {
-            Log.Information($"Could not connect to {node.NodeName}: {ex.GetType()}");
+            ;
             return null;
         }

[NoCoverage] Statement mutation
Communication/Services/Cluster/LogReplicator.cs:126:13
         }
         catch (Exception ex)
         {
-            Log.Information($"Error occurred for node {node.NodeName}: {ex.GetType()} {ex.StackTrace}");
+            ;
             return null;
         }

[Killed] Block removal mutation
Communication/Services/Cluster/LogReplicator.cs:133:5
 
     private async Task<AppendEntriesReply> SendAppendEntriesRequestAsync(NodeInfo follower,
         IList<LogEntryMessage> entries, TimeSpan timeout)
-    {
-        var appendEntriesRequest = EntriesRequestFactory.CreateRequest(follower.NodeName, entries);
-        var deadline = DateTime.UtcNow.Add(timeout);
-        var reply = await clientPool.GetAppendEntriesClient(follower.NodeAddress)
-            .AppendEntriesAsync(appendEntriesRequest, new CallOptions(deadline: deadline));
-        return reply;
-    }
+    {}
 
     private IList<LogEntry> GetEntriesToSendToNode(string nodeName)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Block removal mutation
Communication/Services/Cluster/LogReplicator.cs:142:5
     }
 
     private IList<LogEntry> GetEntriesToSendToNode(string nodeName)
-    {
-        var entriesCount = GetNumberOfEntriesToReplicate(nodeName);
-        return stateStore.GetLastEntries(entriesCount);
-    }
+    {}
 
     private int GetNumberOfEntriesToReplicate(string nodeName)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
Communication/Services/Cluster/LogReplicator.cs:151:16
     {
         var nextIndex = clusterStore.GetNextIndex(nodeName);
         var logLength = stateStore.LogLength;
-        return logLength - nextIndex;
+        return logLength + nextIndex;
     }
     
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader
