[NoCoverage] Equality mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:15:13
             .MapResult(
                 StartRaftClient,
                 _ => 1);
-        if (result != 0)
+        if (result == 0)
         {
             Console.WriteLine("Please provide valid command line options.");

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:17:13
                 _ => 1);
         if (result != 0)
         {
-            Console.WriteLine("Please provide valid command line options.");
+            ;
         }
     }

[NoCoverage] Equality mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:24:13
     private static int StartRaftClient(RaftClientOptions opts)
     {
         var parts = opts.NodeAddress.Split(":");
-        if (parts.Length < 2)
+        if (parts.Length > 2)
         {
             throw new ArgumentException("Invalid node address");

[NoCoverage] Equality mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:24:13
     private static int StartRaftClient(RaftClientOptions opts)
     {
         var parts = opts.NodeAddress.Split(":");
-        if (parts.Length < 2)
+        if (parts.Length <= 2)
         {
             throw new ArgumentException("Invalid node address");

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:26:13
         var parts = opts.NodeAddress.Split(":");
         if (parts.Length < 2)
         {
-            throw new ArgumentException("Invalid node address");
+            ;
         }
 

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:30:9
         }
 
         var raftClient = new RaftClient(parts[0], int.Parse(parts[1]));
-        Console.WriteLine(
-            $"Client is ready to send requests to node {opts.NodeAddress}. Enter a command line or type 'quit' to exit.");
+        ;
 
         while (true)

[NoCoverage] String mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:31:13
 
         var raftClient = new RaftClient(parts[0], int.Parse(parts[1]));
         Console.WriteLine(
-            $"Client is ready to send requests to node {opts.NodeAddress}. Enter a command line or type 'quit' to exit.");
+            $"");
 
         while (true)

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:35:13
 
         while (true)
         {
-            Console.Write("> ");
+            ;
             var command = Console.ReadLine();
             if (command is null or "quit" or "exit" or "q")

[NoCoverage] Equality mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:37:17
         {
             Console.Write("> ");
             var command = Console.ReadLine();
-            if (command is null or "quit" or "exit" or "q")
+            if (command is not null or "quit" or "exit" or "q")
             {
                 return 0;

[NoCoverage] Logical mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:37:28
         {
             Console.Write("> ");
             var command = Console.ReadLine();
-            if (command is null or "quit" or "exit" or "q")
+            if (command is null or "quit" and "exit" or "q")
             {
                 return 0;

[NoCoverage] Block removal mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:38:13
             Console.Write("> ");
             var command = Console.ReadLine();
             if (command is null or "quit" or "exit" or "q")
-            {
-                return 0;
-            }
+            {}
 
             Parser.Default

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:42:13
                 return 0;
             }
 
-            Parser.Default
-                .ParseArguments<PingOptions, InfoOptions, CommandOptions, LogInfoOptions, DisconnectOptions,
-                    ReconnectOptions, GetStateOptions>(command.Split(' ').Select(x => x.Trim()))
-                .WithParsed<PingOptions>(_ => Console.WriteLine(raftClient.Ping()))
-                .WithParsed<InfoOptions>(_ => Console.WriteLine(raftClient.Info()))
-                .WithParsed<CommandOptions>(c => Console.WriteLine(raftClient.Command(c)))
-                .WithParsed<LogInfoOptions>(_ => Console.WriteLine(raftClient.LogInfo()))
-                .WithParsed<DisconnectOptions>(_ => Console.WriteLine(raftClient.Disconnect()))
-                .WithParsed<ReconnectOptions>(_ => Console.WriteLine(raftClient.Reconnect()))
-                .WithParsed<GetStateOptions>(_ => Console.WriteLine(raftClient.GetState()))
-                .WithNotParsed(errors => { Console.WriteLine(errors.ToString()); });
+            ;
         }
     }

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Admin/Program.cs:52:44
                 .WithParsed<DisconnectOptions>(_ => Console.WriteLine(raftClient.Disconnect()))
                 .WithParsed<ReconnectOptions>(_ => Console.WriteLine(raftClient.Reconnect()))
                 .WithParsed<GetStateOptions>(_ => Console.WriteLine(raftClient.GetState()))
-                .WithNotParsed(errors => { Console.WriteLine(errors.ToString()); });
+                .WithNotParsed(errors => { ; });
         }
     }
