[Killed] Statement mutation
Communication/Services/Cluster/RegisterNodeService.cs:14:9
     public override Task<RegisterNodeRply> RegisterNode(RegisterNodeRequest request, ServerCallContext context)
     {
         var result = nodeStore.AddNode(request.Name, new NodeAddress(request.Host, request.Port));
-        Log.Information($"Added node {request.Name}. Cluster members are {nodeStore}");
+        ;
         return Task.FromResult(new RegisterNodeRply
         {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Object initializer mutation
Communication/Services/Cluster/RegisterNodeService.cs:15:32
     {
         var result = nodeStore.AddNode(request.Name, new NodeAddress(request.Host, request.Port));
         Log.Information($"Added node {request.Name}. Cluster members are {nodeStore}");
-        return Task.FromResult(new RegisterNodeRply
-        {
-            Reply = result
-        });
+        return Task.FromResult(new RegisterNodeRply
+{});
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Block removal mutation
Communication/Services/Cluster/RegisterNodeService.cs:22:5
     }
 
     public ServerServiceDefinition GetServiceDefinition()
-    {
-        return RegisterNodeSvc.BindService(this);
-    }
+    {}
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
