[Killed] Arithmetic mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:16:41
 
     public RaftClient(string host, int port)
     {
-        var channel = new Channel(host, port + 1000, ChannelCredentials.Insecure);
+        var channel = new Channel(host, port - 1000, ChannelCredentials.Insecure);
         _pingClient = new PingSvc.PingSvcClient(channel);
         _infoClient = new NodeInfoSvc.NodeInfoSvcClient(channel);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:26:5
     }
 
     public string Ping()
-    {
-        var reply = _pingClient.Ping(new PingRequest());
-
-        return reply.ToString();
-    }
+    {}
 
     public string Info()
killedBy: Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:33:5
     }
 
     public string Info()
-    {
-        var reply = _infoClient.GetInfo(new NodeInfoRequest());
-
-        return reply.ToString();
-    }
+    {}
 
     public string Command(CommandOptions opts)
killedBy: Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Equality mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:41:63
 
     public string Command(CommandOptions opts)
     {
-        if (opts.Operation != "=" && opts.Operation != "-" && opts.Operation != "+")
+        if (opts.Operation != "=" && opts.Operation != "-" && opts.Operation == "+")
         {
             return "Error: the command contained an invalid operation";
killedBy: Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] Equality mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:41:38
 
     public string Command(CommandOptions opts)
     {
-        if (opts.Operation != "=" && opts.Operation != "-" && opts.Operation != "+")
+        if (opts.Operation != "=" && opts.Operation == "-" && opts.Operation != "+")
         {
             return "Error: the command contained an invalid operation";
killedBy: Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:57:5
     }
 
     public string LogInfo()
-    {
-        var logInfo = _logInfoClient.GetLogLInfo(new LogInfoRequest());
-        return logInfo.ToString();
-    }
+    {}
 
     public string Disconnect()
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:63:5
     }
 
     public string Disconnect()
-    {
-        var disconnectReply = _controlClient.DisconnectNode(new DisconnectMessage());
-        return disconnectReply.ToString();
-    }
+    {}
 
     public string Reconnect()
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:69:5
     }
 
     public string Reconnect()
-    {
-        var reconnectReply = _controlClient.ReconnectNode(new ReconnectMessage());
-        return reconnectReply.ToString();
-    }
+    {}
 
     public string GetState()
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] String mutation
RiderProjects/raft-net/Raft.Admin/RaftClient.cs:77:16
     public string GetState()
     {
         var state = _getStateClient.GetState(new GetStateMassage());
-        return $"value: {state.Value}, errors: {state.Errors}";
+        return $"";
     }
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication
