[Killed] Block removal mutation
raft-net/Raft.Node/Extensions/RequestExtensions.cs:10:5
 public static class RequestExtensions
 {
     public static Command FromMessage(this CommandRequest commandRequest)
-    {
-        return new Command(commandRequest.Variable, commandRequest.Operation.ToOperationType(), commandRequest.Literal);
-    }
+    {}
 
     public static LogEntryMessage ToMessage(this LogEntry logEntry)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
raft-net/Raft.Node/Extensions/RequestExtensions.cs:24:5
     }
 
     public static LogEntry FromMessage(this LogEntryMessage logEntry)
-    {
-        return new LogEntry(logEntry.Command.FromMessage(), logEntry.Term);
-    }
+    {}
 
     private static CommandRequest ToMessage(this Command command)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Object initializer mutation
raft-net/Raft.Node/Extensions/RequestExtensions.cs:30:16
 
     private static CommandRequest ToMessage(this Command command)
     {
-        return new CommandRequest()
-        {
-            Variable = command.Variable,
-            Operation = command.Operation.ToPrintable(),
-            Literal = command.Literal
-        };
+        return new CommandRequest()
+{};
     }
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader
