[Killed] Boolean mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:16:28
     {
         _action = action;
         _timer = new Timer(interval); 
-        _timer.AutoReset = true; 
+        _timer.AutoReset = false; 
         _timer.Elapsed += PerformAction;
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:17:9
         _action = action;
         _timer = new Timer(interval); 
         _timer.AutoReset = true; 
-        _timer.Elapsed += PerformAction;
+        _timer.Elapsed -= PerformAction;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Boolean mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:22:26
 
     public void StartBeating()
     {
-        _timer.Enabled = true;
+        _timer.Enabled = false;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Boolean mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:27:26
 
     public void StopBeating()
     {
-        _timer.Enabled = false;
+        _timer.Enabled = true;
     }
     
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:32:9
     
     private void PerformAction(object? sender, ElapsedEventArgs e)
     {
-        Log.Debug($"HeartBeat at {DateTime.Now:HH:mm:ss.fff}");
+        ;
         _action();
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] Statement mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:33:9
     private void PerformAction(object? sender, ElapsedEventArgs e)
     {
         Log.Debug($"HeartBeat at {DateTime.Now:HH:mm:ss.fff}");
-        _action();
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[NoCoverage] Statement mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:38:9
 
     public void ResetTimer()
     {
-        _timer.Stop();
+        ;
         _timer.Start();
     }

[NoCoverage] Statement mutation
raft-net/Raft.Node/HeartBeat/HeartBeatRunner.cs:39:9
     public void ResetTimer()
     {
         _timer.Stop();
-        _timer.Start();
+        ;
     }
 }
