[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:15:13
     public static void Main(string[] args)
     {
         try {
-            Logger.ConfigureLogger();
+            ;
             var result = Parser.Default.ParseArguments<AddOptions>(args)
                 .MapResult(

[NoCoverage] Block removal mutation
RiderProjects/raft-net/Raft.Node/Program.cs:19:21
             var result = Parser.Default.ParseArguments<AddOptions>(args)
                 .MapResult(
                     opts =>
-                    {
-                        _node = AddNode(opts);
-                        return 0;
-                    },
+                    {},
                     errs =>
                     {

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:25:25
                     },
                     errs =>
                     {
-                        Log.Information($"Error: {string.Join(Environment.NewLine, errs)}");
+                        ;
                         return 1;
                     });

[NoCoverage] Equality mutation
RiderProjects/raft-net/Raft.Node/Program.cs:28:17
                         Log.Information($"Error: {string.Join(Environment.NewLine, errs)}");
                         return 1;
                     });
-            if (result != 0)
+            if (result == 0)
             {
                 Log.Information("Please provide valid command line options.");

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:30:17
                     });
             if (result != 0)
             {
-                Log.Information("Please provide valid command line options.");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:31:17
             if (result != 0)
             {
                 Log.Information("Please provide valid command line options.");
-                return;
+                ;
             }
 

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:34:13
                 return;
             }
 
-            Log.Information("Press any key to terminate");
+            ;
             Console.ReadKey();
 

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:35:13
             }
 
             Log.Information("Press any key to terminate");
-            Console.ReadKey();
+            ;
 
             _node?.Stop();

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:37:13
             Log.Information("Press any key to terminate");
             Console.ReadKey();
 
-            _node?.Stop();
+            ;
         } finally {
             Logger.Close();

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:39:13
 
             _node?.Stop();
         } finally {
-            Logger.Close();
+            ;
         }
     }

[NoCoverage] String mutation
RiderProjects/raft-net/Raft.Node/Program.cs:48:13
         return addOptions.Role switch
         {
             "leader" => AddLeaderNode(addOptions),
-            "follower" => AddFollowerNode(addOptions),
+            "" => AddFollowerNode(addOptions),
             _ => throw new ArgumentException($"Unknown role: {addOptions.Role}")
         };

[NoCoverage] Equality mutation
RiderProjects/raft-net/Raft.Node/Program.cs:56:13
     private static RaftNode AddFollowerNode(AddOptions addOptions)
     {
         var port = int.Parse(addOptions.Port);
-        if (addOptions.ClusterHost == null)
+        if (addOptions.ClusterHost != null)
         {
             throw new ArgumentException("ClusterHost is required for follower nodes.");

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:58:13
         var port = int.Parse(addOptions.Port);
         if (addOptions.ClusterHost == null)
         {
-            throw new ArgumentException("ClusterHost is required for follower nodes.");
+            ;
         }
 

[NoCoverage] String mutation
RiderProjects/raft-net/Raft.Node/Program.cs:58:41
         var port = int.Parse(addOptions.Port);
         if (addOptions.ClusterHost == null)
         {
-            throw new ArgumentException("ClusterHost is required for follower nodes.");
+            throw new ArgumentException("");
         }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
RiderProjects/raft-net/Raft.Node/Program.cs:61:13
             throw new ArgumentException("ClusterHost is required for follower nodes.");
         }
 
-        if (!addOptions.ClusterHost.Contains(':'))
+        if (addOptions.ClusterHost.Contains(':'))
         {
             throw new ArgumentException("ClusterHost option should be in the form of Host:port.");

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:63:13
 
         if (!addOptions.ClusterHost.Contains(':'))
         {
-            throw new ArgumentException("ClusterHost option should be in the form of Host:port.");
+            ;
         }
 

[NoCoverage] String mutation
RiderProjects/raft-net/Raft.Node/Program.cs:63:41
 
         if (!addOptions.ClusterHost.Contains(':'))
         {
-            throw new ArgumentException("ClusterHost option should be in the form of Host:port.");
+            throw new ArgumentException("");
         }
 

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:70:9
         var follower = new RaftNode(NodeType.Follower, addOptions.Name, port, clusterHost[0], int.Parse(clusterHost[1]),
             addOptions.TimeoutSeconds);
 
-        follower.Start();
+        ;
         Log.Information($"Created follower node {addOptions.Name} listening on port {port}.");
 

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:71:9
             addOptions.TimeoutSeconds);
 
         follower.Start();
-        Log.Information($"Created follower node {addOptions.Name} listening on port {port}.");
+        ;
 
         return follower;

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:81:9
         var port = int.Parse(addOptions.Port);
         var leader = new RaftNode(NodeType.Leader, addOptions.Name, port, "localhost", port, addOptions.TimeoutSeconds);
 
-        leader.Start();
+        ;
         Log.Information($"Created leader node {addOptions.Name} listening on port {port}");
 

[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.Node/Program.cs:82:9
         var leader = new RaftNode(NodeType.Leader, addOptions.Name, port, "localhost", port, addOptions.TimeoutSeconds);
 
         leader.Start();
-        Log.Information($"Created leader node {addOptions.Name} listening on port {port}");
+        ;
 
         return leader;
