[Killed] Arithmetic mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:55:60
             new ControlService(_heartBeatRunner, _nodeMessageReceiver, _stateStore),
             new GetStateService(_stateStore)
         ];
-        _controlMessageServer = new ControlMessageReceiver(port + 1000, adminServices);
+        _controlMessageServer = new ControlMessageReceiver(port - 1000, adminServices);
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Conditional (false) mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:60:37
 
     public void Start()
     {
-        _stateStore.LeaderAddress = _stateStore.Role == NodeType.Follower
-            ? AskForLeader()
-            : _peerAddress;
+        _stateStore.LeaderAddress = (false?AskForLeader()
+:_peerAddress);
         if (_stateStore.Role == NodeType.Follower)
         {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Conditional (true) mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:60:37
 
     public void Start()
     {
-        _stateStore.LeaderAddress = _stateStore.Role == NodeType.Follower
-            ? AskForLeader()
-            : _peerAddress;
+        _stateStore.LeaderAddress = (true?AskForLeader()
+:_peerAddress);
         if (_stateStore.Role == NodeType.Follower)
         {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Equality mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:63:13
         _stateStore.LeaderAddress = _stateStore.Role == NodeType.Follower
             ? AskForLeader()
             : _peerAddress;
-        if (_stateStore.Role == NodeType.Follower)
+        if (_stateStore.Role != NodeType.Follower)
         {
             var registerNodeClient = _clientPool.GetRegisterNodeClient(_stateStore.LeaderAddress);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:72:13
                 Host = _nodeHost, 
                 Port = _nodePort
             });
-            Log.Information($"Registered with leader {registerReply}");
+            ;
         }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] String mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:72:29
                 Host = _nodeHost, 
                 Port = _nodePort
             });
-            Log.Information($"Registered with leader {registerReply}");
+            Log.Information($"");
         }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:75:9
             Log.Information($"Registered with leader {registerReply}");
         }
 
-        _nodeMessageReceiver.Start();
+        ;
         _controlMessageServer.Start();
         if (_stateStore.Role == NodeType.Leader)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:76:9
         }
 
         _nodeMessageReceiver.Start();
-        _controlMessageServer.Start();
+        ;
         if (_stateStore.Role == NodeType.Leader)
         {
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Equality mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:77:13
 
         _nodeMessageReceiver.Start();
         _controlMessageServer.Start();
-        if (_stateStore.Role == NodeType.Leader)
+        if (_stateStore.Role != NodeType.Leader)
         {
             _heartBeatRunner.StartBeating();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:79:13
         _controlMessageServer.Start();
         if (_stateStore.Role == NodeType.Leader)
         {
-            _heartBeatRunner.StartBeating();
+            ;
         }
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:90:9
         var reply = client.GetLeader(new LeaderQueryRequest());
 
         var leaderAddress = new NodeAddress(reply.Host, reply.Port);
-        Log.Information($"{_nodeName} found leader: {leaderAddress}");
+        ;
 
         return leaderAddress;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:97:9
 
     public void Stop()
     {
-        _nodeMessageReceiver.Stop();
+        ;
         _controlMessageServer.Stop();
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:98:9
     public void Stop()
     {
         _nodeMessageReceiver.Stop();
-        _controlMessageServer.Stop();
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Node/RaftNode.cs:102:5
     }
 
     public string GetClusterState()
-    {
-        var lastIndexes = _clusterStore.GetNodes()
-            .Select(x => (x.NodeName, _clusterStore.GetNextIndex(x.NodeName)))
-            .ToArray();
-        return string.Join(',', lastIndexes);
-    }
+    {}
 
     public string GetNodeState()
killedBy: Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect
