[Killed] Statement mutation
Raft.Store/Domain/Replication/ReplicationLog.cs:11:9
 
     public void Append(LogEntry entry)
     {
-        _entries.Add(entry);
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication

[Killed] Conditional (true) mutation
Raft.Store/Domain/Replication/ReplicationLog.cs:21:16
     /// <returns></returns>
     public LogEntry? GetItemAt(int index)
     {
-        return index < 0 ? null : _entries[index];
+        return (true?null :_entries[index]);
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Equality mutation
Raft.Store/Domain/Replication/ReplicationLog.cs:21:16
     /// <returns></returns>
     public LogEntry? GetItemAt(int index)
     {
-        return index < 0 ? null : _entries[index];
+        return index <= 0 ? null : _entries[index];
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
Raft.Store/Domain/Replication/ReplicationLog.cs:26:9
 
     public void RemoveFrom(int index)
     {
-        _entries.RemoveRange(index, _entries.Count - index);
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Linq method mutation (TakeLast() to SkipLast())
Raft.Store/Domain/Replication/ReplicationLog.cs:31:16
 
     public IList<LogEntry> GetLastEntries(int count)
     {
-        return _entries.TakeLast(count).ToList();
+        return _entries.SkipLast(count).ToList();
     }
     
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] String mutation
Raft.Store/Domain/Replication/ReplicationLog.cs:36:28
     
     public override string ToString()
     {
-        return string.Join(", ", _entries.Select(e => e.Command));
+        return string.Join("", _entries.Select(e => e.Command));
     }
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
