[Killed] Statement mutation
raft-net/Raft.Store/Domain/StateMachine.cs:26:13
     {
         foreach (var command in commands)
         {
-            ApplyCommand(command);
+            ;
         }
         return CurrentState;
killedBy: Raft.Store.Tests.StateMachineTests.ShouldApplyArithmeticOperations; Raft.Store.Tests.StateMachineTests.ShouldCalculateState; Raft.Store.Tests.StateMachineTests.ShouldReturnErrorWhenVariableIsMissing

[Killed] Statement mutation
raft-net/Raft.Store/Domain/StateMachine.cs:35:13
     {
         lock (_lock)
         {
-            UpdateState(command);
+            ;
         }
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Equality mutation
raft-net/Raft.Store/Domain/StateMachine.cs:41:13
 
     private void UpdateState(Command command)
     {
-        if (command.Operation == CommandOperation.Assignment)
+        if (command.Operation != CommandOperation.Assignment)
         {
             _varToValue[command.Variable] = command.Literal;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
raft-net/Raft.Store/Domain/StateMachine.cs:42:9
     private void UpdateState(Command command)
     {
         if (command.Operation == CommandOperation.Assignment)
-        {
-            _varToValue[command.Variable] = command.Literal;
-            CurrentState.Value = command.Literal;
-        } else if (_varToValue.TryGetValue(command.Variable, out var value))
+        {} else if (_varToValue.TryGetValue(command.Variable, out var value))
         {
             _varToValue[command.Variable] = command.Operation == CommandOperation.Plus
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Negate expression
raft-net/Raft.Store/Domain/StateMachine.cs:45:20
         {
             _varToValue[command.Variable] = command.Literal;
             CurrentState.Value = command.Literal;
-        } else if (_varToValue.TryGetValue(command.Variable, out var value))
+        } else if (!(_varToValue.TryGetValue(command.Variable, out var value)))
         {
             _varToValue[command.Variable] = command.Operation == CommandOperation.Plus
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Conditional (true) mutation
raft-net/Raft.Store/Domain/StateMachine.cs:47:45
             CurrentState.Value = command.Literal;
         } else if (_varToValue.TryGetValue(command.Variable, out var value))
         {
-            _varToValue[command.Variable] = command.Operation == CommandOperation.Plus
-                ? value + command.Literal
-                : value - command.Literal;
+            _varToValue[command.Variable] = (true?value + command.Literal
+:value - command.Literal);
             CurrentState.Value = _varToValue[command.Variable];
         }
killedBy: Raft.Store.Tests.StateMachineTests.ShouldApplyArithmeticOperations

[Killed] Equality mutation
raft-net/Raft.Store/Domain/StateMachine.cs:47:45
             CurrentState.Value = command.Literal;
         } else if (_varToValue.TryGetValue(command.Variable, out var value))
         {
-            _varToValue[command.Variable] = command.Operation == CommandOperation.Plus
+            _varToValue[command.Variable] = command.Operation != CommandOperation.Plus
                 ? value + command.Literal
                 : value - command.Literal;
killedBy: Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
raft-net/Raft.Store/Domain/StateMachine.cs:48:19
         } else if (_varToValue.TryGetValue(command.Variable, out var value))
         {
             _varToValue[command.Variable] = command.Operation == CommandOperation.Plus
-                ? value + command.Literal
+                ? value - command.Literal
                 : value - command.Literal;
             CurrentState.Value = _varToValue[command.Variable];
killedBy: Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
raft-net/Raft.Store/Domain/StateMachine.cs:49:19
         {
             _varToValue[command.Variable] = command.Operation == CommandOperation.Plus
                 ? value + command.Literal
-                : value - command.Literal;
+                : value + command.Literal;
             CurrentState.Value = _varToValue[command.Variable];
         }
killedBy: Raft.Store.Tests.StateMachineTests.ShouldApplyArithmeticOperations

[Killed] Statement mutation
raft-net/Raft.Store/Domain/StateMachine.cs:54:13
         }
         else
         {
-            CurrentState.Errors.Add(
-                $"Tried to do arithmetic operation {command.Operation} on unassigned variable {command.Variable}.");
+            ;
         }
     }
killedBy: Raft.Store.Tests.StateMachineTests.ShouldReturnErrorWhenVariableIsMissing
