[NoCoverage] String mutation
raft-net/Raft.Store/Extensions/CommandExtensions.cs:20:45
             case "=":
                 return CommandOperation.Assignment;
             default:
-                throw new ArgumentException($"Unknown operation: {operation}");
+                throw new ArgumentException($"");
         }
     }

[Killed] String mutation
raft-net/Raft.Store/Extensions/CommandExtensions.cs:33:24
             case CommandOperation.Minus:
                 return "-";
             case CommandOperation.Plus:
-                return "+";
+                return "";
             default:
                 throw new ArgumentException($"Unknown operation: {operation}");
killedBy: Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect
