[Survived] Statement mutation
RiderProjects/raft-net/Raft.Communication.Contract/Program.cs:7:9
 {
     public static void Main()
     {
-        Console.WriteLine("Hello World!");
+        ;
     }
 }
