[Killed] Statement mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:14:9
     
     public string AddNode(string nodeName, NodeAddress nodeAddress)
     {
-        _nodes.AddOrUpdate(nodeName, nodeAddress, (_, _) => nodeAddress);
+        ;
         return $"{nodeName} added at {nodeAddress}";
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:19:5
     }
 
     public IEnumerable<NodeInfo> GetNodes()
-    {
-        return _nodes.Keys.Select(k => new NodeInfo(k, _nodes[k]));
-    }
+    {}
 
     public int GetNextIndex(string nodeName)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:24:5
     }
 
     public int GetNextIndex(string nodeName)
-    {
-        return _nextIndex.GetValueOrDefault(nodeName, 0);
-    }
+    {}
 
     public int IncreaseNextLogIndex(string nodeName, int entriesCount)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:30:24
 
     public int IncreaseNextLogIndex(string nodeName, int entriesCount)
     {
-        var newValue = GetNextIndex(nodeName) + entriesCount;
+        var newValue = GetNextIndex(nodeName) - entriesCount;
         _nextIndex[nodeName] = newValue;
         return newValue;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:37:24
     
     public void IncreaseMatchingIndex(string nodeName, int entriesCount)
     {
-        var newValue = GetMatchingIndex(nodeName) + entriesCount;
+        var newValue = GetMatchingIndex(nodeName) - entriesCount;
         _matchingIndex[nodeName] = newValue;
     }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Arithmetic mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:44:44
     public void DecreaseNextLogIndex(string nodeName)
     {
         var nextIndex = GetNextIndex(nodeName);
-        _nextIndex[nodeName] = Math.Max(0, nextIndex - 1);
+        _nextIndex[nodeName] = Math.Max(0, nextIndex + 1);
     }
 
killedBy: Raft.Store.Tests.ClusterNodeStoreTests.ShouldDecreaseIndex; Raft.Store.Tests.ClusterNodeStoreTests.ShouldNotDecreaseNextIndexPastZero

[Killed] Linq method mutation (Max() to Min())
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:44:32
     public void DecreaseNextLogIndex(string nodeName)
     {
         var nextIndex = GetNextIndex(nodeName);
-        _nextIndex[nodeName] = Math.Max(0, nextIndex - 1);
+        _nextIndex[nodeName] = Math.Min(0, nextIndex - 1);
     }
 
killedBy: Raft.Store.Tests.ClusterNodeStoreTests.ShouldDecreaseIndex; Raft.Store.Tests.ClusterNodeStoreTests.ShouldNotDecreaseNextIndexPastZero

[Killed] String mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:55:52
 
     public override string ToString()
     {
-        return string.Join(",", _nodes.Select(n => $"({n.Key}={n.Value})"));
+        return string.Join(",", _nodes.Select(n => $""));
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.RaftNodesShouldFindLeader

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
RiderProjects/raft-net/Raft.Store.Memory/ClusterNodeStore.cs:60:59
 
     public int GetMatchingIndex(string nodeName)
     {
-        return _matchingIndex.GetValueOrDefault(nodeName, -1);
+        return _matchingIndex.GetValueOrDefault(nodeName, +1);
     }
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader
