[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:13:44
     public NodeType Role { get; set; }
     public NodeAddress? LeaderAddress { get; set; }
     public int CurrentTerm { get; set; }
-    public int CommitIndex { get; set; } = -1; // -1 means no items committed
+    public int CommitIndex { get; set; } = +1; // -1 means no items committed
     public int LastApplied { get; set; } = -1; // -1 means no items applied
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:14:44
     public NodeAddress? LeaderAddress { get; set; }
     public int CurrentTerm { get; set; }
     public int CommitIndex { get; set; } = -1; // -1 means no items committed
-    public int LastApplied { get; set; } = -1; // -1 means no items applied
+    public int LastApplied { get; set; } = +1; // -1 means no items applied
 
     public StateMachine StateMachine { get; init; } = new();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:21:9
 
     public void AppendLogEntry(LogEntry entry)
     {
-        _log.Append(entry);
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:25:5
     }
 
     public string PrintLog()
-    {
-        return _log.ToString();
-    }
+    {}
 
     public int GetTermAtIndex(int lastLogIndex)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader; Raft.IntegrationTests.RaftNodeTests.ShouldNotUpdateNextLogIndexWhenUnableToConnect

[Killed] Null coalescing mutation (remove left)
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:31:16
 
     public int GetTermAtIndex(int lastLogIndex)
     {
-        return _log.GetItemAt(lastLogIndex)?.Term ?? -1;
+        return -1;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:31:54
 
     public int GetTermAtIndex(int lastLogIndex)
     {
-        return _log.GetItemAt(lastLogIndex)?.Term ?? -1;
+        return _log.GetItemAt(lastLogIndex)?.Term ?? +1;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:35:5
     }
 
     public LogEntry? EntryAtIndex(int index)
-    {
-        return _log.GetItemAt(index);
-    }
+    {}
 
     public void RemoveLogEntriesFrom(int index)
killedBy: Raft.Node.Tests.AppendEntriesServiceTests.FollowerShouldAppendEntriesIfSuccessful; Raft.Node.Tests.AppendEntriesServiceTests.FollowerShouldOverrideExistingEntriesThatTakeNewEntriesPlace; Raft.Node.Tests.AppendEntriesServiceTests.FollowerShouldRemoveConflictingEntries

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:41:9
 
     public void RemoveLogEntriesFrom(int index)
     {
-        _log.RemoveFrom(index);
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:45:5
     }
 
     public IList<LogEntry> GetLastEntries(int entriesCount)
-    {
-        return _log.GetLastEntries(entriesCount);
-    }
+    {}
 
     public State ApplyCommitted()
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting; Raft.IntegrationTests.RaftNodeTests.ShouldAppendLogEntriesAtLeader

[Killed] Negate expression
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:52:16
     public State ApplyCommitted()
     {
         var state = StateMachine.CurrentState;
-        while (LastApplied < CommitIndex)
+        while (!(LastApplied < CommitIndex))
         {
             LastApplied++;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Equality mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:52:16
     public State ApplyCommitted()
     {
         var state = StateMachine.CurrentState;
-        while (LastApplied < CommitIndex)
+        while (LastApplied > CommitIndex)
         {
             LastApplied++;
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:54:13
         var state = StateMachine.CurrentState;
         while (LastApplied < CommitIndex)
         {
-            LastApplied++;
+            ;
             var entryToApply = _log.GetItemAt(LastApplied)!; 
             state = StateMachine.ApplyCommands([entryToApply.Command]);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] PostIncrementExpression to PostDecrementExpression mutation
RiderProjects/raft-net/Raft.Store.Memory/NodeStateStore.cs:54:13
         var state = StateMachine.CurrentState;
         while (LastApplied < CommitIndex)
         {
-            LastApplied++;
+            LastApplied--;
             var entryToApply = _log.GetItemAt(LastApplied)!; 
             state = StateMachine.ApplyCommands([entryToApply.Command]);
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
