[Killed] String mutation
RiderProjects/raft-net/Raft.RpcServer/ControlMessageReceiver.cs:10:34
 {
     private readonly Server _server = new()
     {
-        Ports = { new ServerPort("0.0.0.0", port, ServerCredentials.Insecure) }
+        Ports = { new ServerPort("", port, ServerCredentials.Insecure) }
     };
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.RpcServer/ControlMessageReceiver.cs:17:13
     {
         foreach (var service in services)
         {
-            _server.Services.Add(service.GetServiceDefinition());
+            ;
         }
         _server.Start();
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.RpcServer/ControlMessageReceiver.cs:19:9
         {
             _server.Services.Add(service.GetServiceDefinition());
         }
-        _server.Start();
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication

[Killed] Statement mutation
RiderProjects/raft-net/Raft.RpcServer/ControlMessageReceiver.cs:24:9
 
     public void Stop()
     {
-        _server.ShutdownAsync().Wait();
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
