[NoCoverage] Statement mutation
RiderProjects/raft-net/Raft.RpcServer/RaftMessageReceiver.cs:30:13
         }
         catch (RpcException e)
         {
-            Console.WriteLine($"Error shutting down: {e}, maybe the server has already been stopped?");
+            ;
         }
     }

[NoCoverage] String mutation
RiderProjects/raft-net/Raft.RpcServer/RaftMessageReceiver.cs:30:31
         }
         catch (RpcException e)
         {
-            Console.WriteLine($"Error shutting down: {e}, maybe the server has already been stopped?");
+            Console.WriteLine($"");
         }
     }

[Killed] Statement mutation
RiderProjects/raft-net/Raft.RpcServer/RaftMessageReceiver.cs:36:9
 
     public void DisconnectFromCluster()
     {
-        Stop();
+        ;
     }
 
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Statement mutation
RiderProjects/raft-net/Raft.RpcServer/RaftMessageReceiver.cs:45:9
         {
             Ports = { new ServerPort("0.0.0.0", port, ServerCredentials.Insecure) }
         };
-        Start();
+        ;
     }
 }
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting
