[Killed] String mutation
RiderProjects/raft-net/Raft.Shared/Logger.cs:12:55
 {
     public static void ConfigureLogger()
     {
-        var settingsLocation = GetLogSettingsLocation("appsettings.json");
+        var settingsLocation = GetLogSettingsLocation("");
         var configuration = new ConfigurationBuilder()
             .AddJsonFile(settingsLocation)
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Killed] Block removal mutation
RiderProjects/raft-net/Raft.Shared/Logger.cs:23:5
     }
     
     private static string GetLogSettingsLocation(string settingsName)
-    {
-        var projectLocation = Path.GetDirectoryName(Assembly.GetExecutingAssembly().Location);
-        return Path.Combine(projectLocation!, settingsName);
-    }
+    {}
 
     public static void Close()
killedBy: Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnFollowerAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldApplyCommittedEntriesOnLeaderAfterReplication; Raft.IntegrationTests.RaftLogReplicationTests.ShouldReconcileFollowerLogAfterReconnecting

[Survived] Statement mutation
RiderProjects/raft-net/Raft.Shared/Logger.cs:30:9
 
     public static void Close()
     {
-        Log.CloseAndFlush();
+        ;
     }
 }
